#!/usr/bin/env python3
# coding=utf-8

"""
@author: guoyanfeng
@software: PyCharm
@time: 19-10-9 下午3:43
"""

from tabdoc import ValueAttr, WordWriter

if __name__ == '__main__':
    data1 = [[ValueAttr('基础基213中学教学班数、班额情况 ', "D8D8D8"), '', '', '', '', '', '', '', '', '', '', '', ' 单位：个'],
             ['', '', '编号', '合计', '初中', '', '', '', '', '高中', '', '', ''],
             ['', '', '', '', '计', '一年级', '二年级', '三年级', '四年级', '计', '一年级', '二年级', '三年级'],
             ['甲', '', '乙', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10'],
             ['总计', '', '01', '', '', '', '', '', '', '', '', '', ''],
             ['其中：四年制初中', '', '02', '', '', '', '', '', '', '', '', '', ''],
             ['班\n额\n', '25人及以下', '03', '', '', '', '', '', '', '', '', '', ''],
             ['', '66人及以上', '12', '', '', '', '', '', '', '', '', '']]
    # {'value': '555', 'color': '#D8D8D8', 'horizontal': "bottom", 'vertical': "middle"}]]

    with WordWriter("test_docx") as xls:
        xls.add_table("测试", [data1[0]], data1[1:], merge_cells=[[(0, 0), (0, 12)]])
